<?php
global $_W;
$conste = array('摩羯座','水瓶座','双鱼座','白羊座','金牛座','双子座','巨蟹座','狮子座','处女座','天秤座','天蝎座','射手座');
// $DOB = date("m-d", strtotime($DOB)); 
// list($month,$day) = explode("-",$DOB);
$month  = $_GET['month']  - 1;
$day    = $_GET['day'];
$strength = "关于$conste[$month]的优点";
if(($month == '0' && $day <= '19') || ($month == '11' && $day >= '22')){
	$title    = "坚强的摩羯座";//12.22-1.19
	$natrue   = '坚守原则';
	$love     = '经济基础，决定上层建筑！';
	$business =  '踏实的作风助你达成目标';
	$strength = '1、有实际的人生观</br>2、做事脚踏实地</br>3、意志力强，不容易受影响</br>4、处处谨慎</br5、有克服困难的毅力</br>6、坚守原则、重视纪律</br>7、有家庭观念</br>8、对人谦逊</br>9、有独树一格的幽默感';
}else if(($month == '0' && $day >= '20') || ($month == '1' && $day <= '18')){
    $title    = "独立的水瓶座";//1.20-2.18
    $natrue   = '冷井深情';
    $love     = '满世界找怪人！';
    $business = '热爱知识，精神生活丰富';
    $strength = '1、崇尚自由</br>2、充满人道精神</br>3、兴趣广泛、创意十足</br>4、乐于发掘真理</br>5、有前瞻性</br>6、拥有理性的智慧</br>7、独立，有个人风格</br>8、乐於助人</br>9、对自己的感情忠实';
}else if(($month == '1' && $day >= '19') || ($month == '2' && $day <= '20')){
    $title    = "浪漫的双鱼座";//2.19-3.20
    $natrue   = '多情种子';
    $love     = '我的王子（公主）在哪里？';
    $business = '要加强锻炼意志力';
    $strength = '1、感情丰富</br>2、心地仁慈，舍己为人，不自私</br>3、具有想像力</br>4、善解人意</br>5、直觉力强</br>6、懂得包容</br>7、温和有礼</br>8、容易信赖别人，不多疑</br>9、浪漫';
}else if(($month == '2' && $day >= '21') || ($month == '3' && $day <= '19')){
    $title    = "勇敢的白羊座";//3.21-4.19
    $natrue   = '长不大的孩子';
    $love     = '寻找、瞄准、进攻！';
    $business = '虽然你是乐天派，但凡事要稳着点';
    $strength = '1、做事积极、热情有活力</br>2、讲义气</br>3、乐观进取有自信</br>4、勇于接受新观念</br>5、有明快的决断力</br>6、坦白率真</br>7、爆发力强</br>8、勇于接受挑战</br>9、不畏权势';
}else if(($month == '3' && $day >= '20') || ($month == '4' && $day <= '20')){
    $title    = "务实的金牛座";//4.20-5.20
    $natrue   = '标准型靠得住';
    $love     = '敌不动我不动。敌一动我自岿然不动！';
    $business = '偶尔跨出保守，是良性的冒险';
    $strength = '1、耐性十足</br>2、一往情深</br>3、有艺术天份</br>4、脚踏实地</br>5、做事有计划</br>6、能坚持到底</br>7、择善固执</br>8、追求和平，生活有规律</br>9、值得信赖';
}else if(($month == '4' && $day >= '21') || ($month == '5' && $day <= '21')){
    $title    = "机智的双子座";//5.21-6.21
    $natrue   = '多才多艺';
    $love     = '我是视觉系！';
    $business = '好奇、好动、好玩、你的人生好精彩';
    $strength = '1、多才多艺</br>2、见人说人话，见鬼说鬼话</br>3、足智多谋，反应灵敏</br>4、八面玲珑，善于交际</br>5、懂得随机应变</br>6、充满生命力</br>7、擅长沟通</br>8、知进退，有分寸</br>9、适应力强';
}else if(($month == '5' && $day >= '22') || ($month == '6' && $day <= '22')){
    $title    = "热心的巨蟹座";//6.22-7.22
    $natrue   = '月亮之子';
    $love     = '偷偷观察。画个圈圈诅咒你！';
    $business = '减少情绪风暴发生的次数，你的人生更美好';
    $strength = '1、情感真挚深切</br>2、想像力丰富</br>3、念旧、重情义</br>4、有包容力</br>5、直觉敏锐</br>6、懂得体贴、关怀</br>7、亲切温暖</br>8、善解人意</br>9、有同情心';
}else if(($month == '6' && $day >= '23') || ($month == '7' && $day <= '22')){
    $title    = "霸气的狮子座";//7.23-8.22
    $natrue   = '阳光之子';
    $love     = '爱你就把全世界都给你！';
    $business = '小信被强烈的自尊心反咬一口';
    $strength = '1、有领导能力</br>2、具有激励人心的气质</br>3、组织力强</br>4、热情开朗、对人慷慨大方</br>5、心胸宽大，懂得宽怒</br>6、一言九鼎有信用</br>7、乐观</br>8、不多疑</br>9、诚恳正直';
}else if(($month == '7' && $day >= '23') || ($month == '8' && $day <= '22')){
    $title    = "善辩的处女座";//8.23-9.22
    $natrue   = '随时自省';
    $love     = '对你好到无可救药！';
    $business = '注意小细节，更要抓紧大方向';
    $strength = '1、追求完美，永不气馁</br>2、脚踏实地</br>3、事事谨慎小心</br>4、善于收集资料</br>5、勤奋努力</br>6、守本份，靠得住</br>7、谦逊不夸大</br>8、有精确的观察力</br>9、有耐性';
}else if(($month == '8' && $day >= '23') || ($month == '9' && $day <= '23')){
    $title    = "优雅的天秤座";//9.23-10.23
    $natrue   = '平和人士';
    $love     = '普遍撒网，重点捕捞！';
    $business = '持中庸之道享受平稳的人生';
    $strength = '1、公平客观</br>2、有正义感</br>3、适应力强</br>4、对美感有鉴赏力</br>5、逻辑强，善分析</br>6、天生的优雅风采</br>7、浪漫的恋爱高手</br>8、有外交手腕</br>9、因事制宜，能屈能伸，适应力强';
}else if(($month == '9' && $day >= '24') || ($month == '10' && $day <= '22')){
    $title    = "神秘的天蝎座";//10.24-11.22
    $natrue   = '性感的复仇者';
    $love     = '玩的就是心跳';
    $business = '可以孤独，但勿封闭';
    $strength = '1、深谋远虑</br>2、恩怨分明</br>3、直觉敏锐</br>4、对决定的事有执行力</br>5、不畏挫折，坚持到底</br>6、对朋友讲义气</br>7、天生的性感魅力</br>8、坚持追求事情的真相</br>9、善于保守秘密';
}else if(($month == '10' && $day >= '23') || ($month == '11' && $day <= '21')){
    $title    = "乐观的射手座";//11.23-12.21
    $natrue   = '自由流浪者';
    $love     = '只是想找个玩伴';
    $business = '追求自由哦，接近阳光';
    $strength = '1、天生乐观</br>2、对人生充满理想</br>3、有救世救人的热情</br>4、丰富的幽默感</br>5、酷爱和平</br>6、待人友善</br>7、行动力强</br>8、有自己的处世哲学</br>9、经得起打击';
}
//获取result数据
$list = pdo_fetch("SELECT * FROM ".tablename('aj_conste')." WHERE `uniacid`=:uniacid ORDER BY `id` DESC",array(':uniacid'=>$_W['uniacid']));
//加载视图
include $this->template('result');
?>